Autorizadores/E-Receita/M3143302/Exemplos/envelopamento/CancelarNfse.xml

<?xml version="1.0" encoding="ISO-8859-1"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><CancelarNfseRequest xmlns="http://www.ereceita.net.br/soap/NfseWebService"><nfseCabecMsg>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;cabecalho versao=&quot;2.02&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns=&quot;http://www.abrasf.org.br/nfse.xsd&quot;&gt;
   &lt;versaoDados&gt;2.02&lt;/versaoDados&gt;
&lt;/cabecalho&gt;
</nfseCabecMsg><nfseDadosMsg>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;CancelarNfseEnvio xmlns=&quot;http://www.abrasf.org.br/nfse.xsd&quot;&gt;&lt;Pedido&gt;&lt;InfPedidoCancelamento Id=&quot;PDD1&quot;&gt;&lt;IdentificacaoNfse&gt;&lt;Numero&gt;201500000010001&lt;/Numero&gt;&lt;CpfCnpj&gt;&lt;Cnpj&gt;99999999999999&lt;/Cnpj&gt;&lt;/CpfCnpj&gt;&lt;InscricaoMunicipal&gt;9.9.99999999&lt;/InscricaoMunicipal&gt;&lt;CodigoMunicipio&gt;3106200&lt;/CodigoMunicipio&gt;&lt;/IdentificacaoNfse&gt;&lt;CodigoCancelamento&gt;1&lt;/CodigoCancelamento&gt;&lt;/InfPedidoCancelamento&gt;&lt;Signature xmlns=&quot;http://www.w3.org/2000/09/xmldsig#&quot;&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;SignatureMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#rsa-sha1&quot;/&gt;&lt;Reference URI=&quot;#PDD1&quot;&gt;&lt;Transforms&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#enveloped-signature&quot;/&gt;&lt;Transform Algorithm=&quot;http://www.w3.org/TR/2001/REC-xml-c14n-20010315&quot;/&gt;&lt;/Transforms&gt;&lt;DigestMethod Algorithm=&quot;http://www.w3.org/2000/09/xmldsig#sha1&quot;/&gt;&lt;DigestValue&gt;kiXO54GQewhmznGs/9BP13SkxIA=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;KfikAHGka5bDx5RSHl/lDVymXsgJPRQh98pEKzVopTNN7uqBmdayKOJVW5PtPtRmQyRHgBUKKtLgJJdToh0A56i83qA3I41Vx7WnhGs7xrvlmijGAKiYIFAHNacdkV/7qemVnx23VjKSdJbMbZyNgKrv+wRYg8irsKBu7mYT9h8=&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;X509Data&gt;&lt;X509Certificate&gt;MIICVTCCAb4CCQD3A3l4B6OnbTANBgkqhkiG9w0BAQsFADBvMQswCQYDVQQGEwJCUjELMAkGA1UECAwCTUcxCzAJBgNVBAcMAkJIMQwwCgYDVQQKDANSUFAxCzAJBgNVBAsMAlRJMQwwCgYDVQQDDANBVkExHTAbBgkqhkiG9w0BCQEWDmF2YUBycHAuY29tLmJyMB4XDTE0MTIwMjEyNTU0MloXDTE1MTIwMjEyNTU0MlowbzELMAkGA1UEBhMCQlIxCzAJBgNVBAgMAk1HMQswCQYDVQQHDAJCSDEMMAoGA1UECgwDUlBQMQswCQYDVQQLDAJUSTEMMAoGA1UEAwwDQVZBMR0wGwYJKoZIhvcNAQkBFg5hdmFAcnBwLmNvbS5icjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAtJ98TqJNetG7QTT5j/oV/9LUf+BnNe3I9L097xGy19WbMJikUo+FvQ3o/eL0m/tCTY6zeMAZeuafQqhDaz4duz7+WTJ6BBKy5ZX2lu39bl3S7bbAIm3vwNaKKf2PIEHPKe3zg2dLGh6p6UeLq4ULu4JZG11++lA8Mf1m8c5hN2UCAwEAATANBgkqhkiG9w0BAQsFAAOBgQCgJ8rS8Yq28tS5SM0ovAD6GMoRJpHqi6bj+nvzy6EB8XQvyK80bX84wBVFjWYccIayHICpz27sckFgd70kNDWs2biFVNj9FeCx8qpazL9/i+cgHLRf6tSKOkdlKNeBiD20OnpnKlPiMPqYEVdfQUfNWp0ru8ylBHS4J+lS5oeRlA==&lt;/X509Certificate&gt;&lt;/X509Data&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/Pedido&gt;&lt;/CancelarNfseEnvio&gt;
</nfseDadosMsg></CancelarNfseRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
